app/controllers/user_currencies_controller.rb

  def filter_currencies
    @user_currencies = current_user.user_currencies.where("name like'#{params[:search_text]}%'")
---
SELECT "user_currencies".* FROM "user_currencies"  WHERE "user_currencies"."user_id" = ? AND (name like'D%')  [["user_id", 4]]