app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    current_user.set_user_default_data
    @users = User.all