app/views/user_currencies/_charts.html.erb

SELECT "user_currencies".* FROM "user_currencies"  WHERE "user_currencies"."user_id" = ? AND (name like'D%')  [["user_id", 4]]
---
	function drawCurrencyPieChart(){
		var pie_chart_data = google.visualization.arrayToDataTable([
			["Currency", "Percentage"],
			["Collected", <%= UserCurrency.collected_currencies(currencies,current_user.id).count %>],
			["Not Collected", <%= UserCurrency.not_collected_currencies(currencies,current_user.id).count %>]
		]);