app/views/user_currencies/_currency_list.html.erb

        <td><%= link_to user_currency.try(:user_country).try(:name), user_currency.try(:user_country) %></td>
        <td><%=check_box_tag 'Collect', current_user.get_collected_currency(user_currency.country_id), current_user.get_collected_currency(user_currency.country_id), :onclick => "onUpdateCurrencycollected('#{user_currency.try(:user_country).try(:code)}', this);", :class=>"currencies_visited" %> </td>
---
SELECT  "user_countries".* FROM "user_countries"  WHERE "user_countries"."user_id" = ? AND "user_countries"."code" = 'to'  ORDER BY "user_countries"."code" ASC LIMIT 1  [["user_id", 4]]